app/controllers/images_controller.rb

SELECT `images`.* FROM `images`
---
  def index
    @images = Image.all

INSERT INTO `images` (`avatar`, `created_at`, `updated_at`) VALUES ('2.png', '2015-01-06 08:42:51.591665', '2015-01-06 08:42:51.591665')
---
  def create
    @image = Image.create(image_params)

SELECT  `images`.* FROM `images` WHERE `images`.`id` = 29 LIMIT 1
---
  def edit
    @image = Image.find_by_id(params[:id])

SELECT  `images`.* FROM `images` WHERE `images`.`id` = 25 LIMIT 1
---
  def update
    @image = Image.find_by_id(params[:id])